Revit 2027 API
RebarBarType.GetHookPermission Method
 Identifies if a hook type is permitted for this bar type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetHookPermission(
	ElementId hookId
)
Public Function GetHookPermission (
	hookId As ElementId
) As Boolean
public:
bool GetHookPermission(
	ElementId^ hookId
)
member GetHookPermission :
        hookId : ElementId -> bool
Parameters
hookId ElementId
 id of the hook type
Return Value
Boolean
 True if the hook type is permitted for this bar type, otherwise false
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace